# 📱 Исследование продаж телефонов

В ходе анализа данных из таблиц `table_checkout` и `table_phones` (на основе соединения по `phone_id`) были получены следующие ответы на вопросы отдела маркетинга:

## 1. Телефоны какого цвета чаще всего покупают?

Самым популярным цветом является **Black** (مشکی).

* **Обоснование:** Этот цвет имеет **17** продаж, что является наибольшим показателем среди всех представленных цветов.

## 2. Какие телефоны чаще покупают: красные или синие?

Чаще покупают **красные** телефоны.

* **Обоснование:** Красные телефоны имеют **11** продаж, в то время как синие телефоны имеют **10** продаж. Разница составляет **1** продажу.

## 3. Какой самый непопулярный цвет телефона?

Самым непопулярным цветом является **Green** (سبز).

* **Обоснование:** Этот цвет имеет наименьшее количество продаж – всего **9** продаж.
